Merge branch 'partitioning' into dev [GIVE4GOOD-834]
